//task 1. Составьте программу, которая присваивает //переменной d значение 7, 
//а затем выводит на экран: в первой строке - это значение, во второй – квадрат этого значения, в третьей – куб этого значения.
//task1
//let d = 7;
//console.log(d);
//let d1 = 7**2;
//console.log(d1);
//let d2 =7;
//Math.sqrt(d2);
//console.log(d2);

//task2
//Составьте программу, которая принимает с клавиатуры целое число и, если оно положительное, увеличивает его вдвое.
//Программа должна выводить на экран новое значение.

//let num = Number(prompt("enter the number"));
//if (num > 0 *2){
    //console.log(num*2);
//}

//task3
//Составьте программу, которая принимает с клавиатуры два целых числа и, 
//если первое больше второго, выводит на экран их сумму, если же наоборот – выводит на экран их произведение. 
//В случае же, если числа одинаковы, программа выводит на экран сообщение "числа одинаковые".

//let first_number = Number(prompt("enter the first number"));
//let second_number = Number(prompt("enter the second number"));

//if (first_number>second_number){
    //console.log(first_number+second_number); 
//}
//else if(first_number<second_number){
    //console.log(first_number*second_number);
//}
//else if (first_number==second_number){
    //console.log("числа одинаковые");
//}

//task 4.
//Составьте программу, которая принимает с клавиатуры целое число и выводит на экран его квадрат – 
//но только в том случае, если введенное число отрицательно. 
//В противном случае – на экран выводится сообщение "ошибка".

//let num = Number(prompt("enter the number"));
//if(num < 0**2){
   // console.log(num**2);
//}
//else if (num > 0 ){
   // console.log("ошибка");
//}

//task 5. 
//Составьте программу, которая принимает с клавиатуры два числа: первое – количество учеников в классе, второе – количество стульев в кабинете. 
//Программа проверит соответствие между этими двумя значениями и выведет на экран соответствующую информацию.
//ввод: 24, 28 ⇒ вывод: стульев хватает; ввод: 24, 22 ⇒ вывод: стульев не хватает)
//let num1 = Number(prompt("количество учеников в классе"));
//let num2 = Number(prompt("количество стульев в кабинете"));
//if(num1 == 24 && num2 == 28) {
    //console.log("стульев хватает")
//}
//else if(num1 ==24 && num2 ==22) {
//console.log('стульев не хватает');
//} 

//task 6
//Составьте программу, которая выводит на экран все однозначные положительные числа в возрастающем порядке. 
//Перед началом вывода на экран следует вывести "старт", а после окончания вывода чисел – "финиш".
////вывод: старт, 1, … 9, финиш)
//let i1 = "start";
//console.log(i1);
//for (let i=0;i<10;i++){
  //    console.log(i);
//}
//let i2 = "finish";
//console.log(i2);

//task 8
//let arr=[1,3,5,7,10,15,17,20]
//for(let i=0;i<20; i++){
    //if(i==15){
        //console.log(i);
//}
    //else if (i>15);
   // console.log(i); 
//}

//task9.
//Написать цикл, который выводит только нечетные числа 
//for(let i=0; i < 15; i=2){
    //console.log(i);
//}








